init-mod-org.org
* org-mode (~init-mod-org.el~)
:PROPERTIES:
:tangle:   lisp/init-mod-org.el
:END:
Org is a mode for keeping notes, maintaining TODO lists, and doing
project planning with a fast and effective plain-text system.

General
| M-p           | metaup                       |
| M-n           | metadown                     |
| C-p           | Previous src block           |
| C-n           | Next src block               |
| <prior>       | Previous link                |
| <next>        | Next link                    |
| n (speed-key) | Show next heading tidily     |
| p (speed-key) | Show previous heading tidily |

Tasks
| C-c C-t | Choose keyword |

Clock
| ~F11~     | clock in a task (show menu with prefix) |
| ~S-F11~   | clock out of task                       |
| ~M-F11~   | Punch Clock In                          |
| ~M-S-F11~ | Punch Clock Out                         |
| ~C-F11~   | go to the currently clocked item        |
| ~C-S-F11~ | show clocked items history              |

Babel
| ~C-S-s~    | Tangle file.                                                            |
| ~C-Esc~    | Source block editing.                                                   |
| ~C-<pipe>~ | Copy surrounding region and send a ~%paste~ command to adjacent buffer. |
** General
#+BEGIN_SRC elisp
(require 'org)
#+END_SRC

Use org as the default mode for .org, .org_archive, and .txt files.
#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
#+END_SRC

Single keys can be made to execute commands when the cursor is at the
beginning of a headline, speeding up the navigation.
#+BEGIN_SRC elisp
(setq org-use-speed-commands t)
#+END_SRC

Show entities as UTF8 characters.
#+BEGIN_SRC elisp
(setq org-pretty-entities t)    
#+END_SRC

Open PDFs in Evince (and not in the default choice) http://stackoverflow.com/a/8836108/789593.
#+BEGIN_SRC elisp
(add-hook 'org-mode-hook
      '(lambda ()
         (delete '("\\.pdf\\'" . default) org-file-apps)
         (add-to-list 'org-file-apps '("\\.pdf\\'" . "evince %s"))))
#+END_SRC

Allow local variable definitions.
#+BEGIN_SRC emacs-lisp
(setq org-export-allow-bind-keywords t)
#+END_SRC
Example:
#+BEGIN_EXAMPLE
#+BIND: org-latex-default-figure-position "H"
#+BIND: org-latex-image-default-width ""
#+END_EXAMPLE

Make yasnippet work in org-mode.
#+BEGIN_SRC emacs-lisp
  (defun yas/org-very-safe-expand ()
    (let ((yas/fallback-behavior 'return-nil)) (yas/expand)))
  (add-hook 'org-mode-hook
            (lambda ()
              (make-variable-buffer-local 'yas/trigger-key)
              (setq yas/trigger-key [tab])
              (add-to-list 'org-tab-first-hook 'yas/org-very-safe-expand)
              (define-key yas/keymap [tab] 'yas/next-field)))
#+END_SRC

Make windmove work in org-mode.
#+BEGIN_SRC emacs-lisp
(add-hook 'org-shiftup-final-hook 'windmove-up)
(add-hook 'org-shiftleft-final-hook 'windmove-left)
(add-hook 'org-shiftdown-final-hook 'windmove-down)
(add-hook 'org-shiftright-final-hook 'windmove-right)
#+END_SRC

Provide some convenient rebindings.
#+BEGIN_SRC elisp
(defun custom-org-mode-defaults ()
"Executed as org-mode-hook."
(electric-indent-mode -1)
(org-defkey org-mode-map (kbd "M-p") 'org-metaup)
(org-defkey org-mode-map (kbd "M-n") 'org-metadown)
(org-defkey org-mode-map (kbd "C-p") 'org-babel-previous-src-block)
(org-defkey org-mode-map (kbd "C-n") 'org-babel-next-src-block)
(org-defkey org-mode-map (kbd "<prior>") 'org-previous-link)
(org-defkey org-mode-map (kbd "<next>") 'org-next-link)
(org-shifttab 2))
(add-hook 'org-mode-hook 'custom-org-mode-defaults)
#+END_SRC
Speed keys ~n~ and ~p~ are rebind to a tidier view of next/previous entries.
#+BEGIN_SRC elisp
(defun ded/org-show-next-heading-tidily ()
  "Show next entry, keeping other entries closed."
  (if (save-excursion (end-of-line) (outline-invisible-p))
      (progn (org-show-entry) (show-children))
    (outline-next-heading)
    (unless (and (bolp) (org-on-heading-p))
      (org-up-heading-safe)
      (hide-subtree)
      (error "Boundary reached"))
    (org-overview)
    (org-reveal t)
    (org-show-entry)
    (show-children)))
(add-to-list 'org-speed-commands-user
             '("n" ded/org-show-next-heading-tidily))
(defun ded/org-show-previous-heading-tidily ()
  "Show previous entry, keeping other entries closed."
  (let ((pos (point)))
    (outline-previous-heading)
    (unless (and (< (point) pos) (bolp) (org-on-heading-p))
      (goto-char pos)
      (hide-subtree)
      (error "Boundary reached"))
    (org-overview)
    (org-reveal t)
    (org-show-entry)
    (show-children)))
(add-to-list 'org-speed-commands-user 
             '("p" ded/org-show-previous-heading-tidily))
#+END_SRC
** Tasks
Add a time stamp to the task when moved to DONE.
#+BEGIN_SRC elisp
(setq org-log-done 'time)
#+END_SRC

Set the default workflow keywords (~C-c C-t~ to choose) and their faces.
#+BEGIN_SRC elisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!/!)")
        (sequence "WAITING(w@/!)" "HOLD(h@/!)" "SOMEDAY(o)" "|" "CANCELLED(c@/!)")))

(setq org-todo-keyword-faces
      '(("TODO"      :foreground "red"     :weight bold)
        ("NEXT"      :foreground "#e9c062" :weight bold) ; "blue"?
        ("DONE"      :foreground "forest green" :weight bold)
        ("WAITING"   :foreground "#fd9b3b" :weight bold)
        ("HOLD"      :foreground "#9b859d" :weight bold)
        ("SOMEDAY"   :foreground "#808080" :weight bold)
        ("CANCELLED" :foreground "#9eb9a7" :weight bold)))
#+END_SRC
