init-mod-org.org
** Capture
Assign the global key ~F9~ for capture (1 key less than the more popular ~C-c c~).
#+BEGIN_SRC elisp
(define-key global-map "\C-cc" 'org-capture)
#+END_SRC

When a capture template specifies a target file that is not an absolute path, or filed away in an interactive way (with ~C-1 C-c C-c~), the path/prompted org file, will then be interpreted relative to ~org-directory~.
#+BEGIN_SRC elisp
(setq org-directory "~/org")
#+END_SRC

Set the default target file for those capture templates that do not specify one.
#+BEGIN_SRC elisp
(setq org-default-notes-file "~/org/capture.org")
#+END_SRC

Here are capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol.
#+BEGIN_SRC elisp
(setq org-capture-templates
      (quote (("t" "todo" entry (file "capture.org")
               "* TODO %?" :clock-in t :clock-resume t)
              ("p" "I was procrastinating" entry (file+headline "~/org/personal-procrastination.org" "I was procrastinating instead of")
               "* %? %i\n- [ ] Think how the task is relevant and meaningful to your interests and goals\n- [ ] Set reasonable standards to be expected from you in completing the task\n- [ ] Give the right weight to others' evaluation of your work\n- [ ] Be aware of the personal resources you can leverage on to do the job\n- [ ] Decide how much you really want to invest in the task\n- [ ] Feel ready to accept the responsibilities involved?\n- [ ] Spend enough time in defining the outcome and developing the steps needed to accomplish that outcome" :clock-in t :clock-resume t)
              ("r" "respond" entry (file "capture.org")
               "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
              ("n" "note" entry (file "capture.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("j" "Journal" entry (file+datetree "diary.org")
               "* %?\n%U\n" :clock-in t :clock-resume t)
              ("w" "org-protocol" entry (file "capture.org")
               "* TODO Review %c\n%U\n" :immediate-finish t)
              ("m" "Meeting" entry (file "capture.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
              ("h" "Habit" entry (file "capture.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"<%Y-%m-%d %a .+1d/3d>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))
#+END_SRC

Provide some convenient key bindings to access those templates directly.
#+BEGIN_SRC elisp
(define-key global-map (kbd "<M-f9>")
  (lambda () (interactive) (org-capture nil "t")))
(define-key global-map (kbd "<M-S-f9>")
  (lambda () (interactive) (org-capture nil "r")))
(define-key global-map (kbd "<C-f9>")
  (lambda () (interactive) (org-capture nil "j")))
(define-key global-map (kbd "<C-S-f9>")
  (lambda () (interactive) (org-capture nil "n")))
#+END_SRC
** Refile
Refiling (~C-c C-w~, or ~w~ speed command) is extremely useful, especially after a capture.

Make all the headlines of all the agenda files up to the 3rd level available as refile targets (helm helps a lot here in getting the right target!).
#+BEGIN_SRC emacs-lisp
  (setq org-refile-targets (quote ((nil :maxlevel . 3)
                                   (org-agenda-files :maxlevel . 3))))
#+END_SRC

Choose refiling targets in one step, showing levels as paths including the name of the files they belong to.
#+BEGIN_SRC emacs-lisp
  (setq org-outline-path-complete-in-steps nil)
  (setq org-refile-use-outline-path 'file)
#+END_SRC
** Rest
#+BEGIN_SRC elisp
  ;; * Org-mode

  (require 'org-habit)

  ;; ** Agenda


  ;; ** Latex
  (setq org-latex-pdf-process (list "latexmk -f -pdf %f"))

  ;; ** Babel
  (cond ((eq window-system 'w32)
         (setq org-babel-sh-command "C:/cygwin/bin/sh.exe"))
         (t
          (setq org-babel-sh-command "sh")))
  ;; this will use emacs syntax higlighting in your #+BEGIN_SRC
  ;; <language> <your-code> #+END_SRC code blocks.
  (setq org-src-fontify-natively t)
  (setq org-src-window-setup 'current-window)
  ;; add <p for python expansion
  (add-to-list 'org-structure-template-alist
               '("p" "#+BEGIN_SRC python\n?\n#+END_SRC" "<src lang=\"python\">\n?\n</src>"))
  ;; add <por for python expansion with raw output
  (add-to-list 'org-structure-template-alist
               '("por" "#+BEGIN_SRC python :results output raw\n?\n#+END_SRC" "<src lang=\"python\">\n?\n</src>"))
  ;; add <pv for python expansion with value
  (add-to-list 'org-structure-template-alist
               '("pv" "#+BEGIN_SRC python :results value\n?\n#+END_SRC" "<src lang=\"python\">\n?\n</src>"))
  ;; add <el for emacs-lisp expansion
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC" "<src lang=\"emacs-lisp\">\n?\n</src>"))
  ;; add <sh for shell
  (add-to-list 'org-structure-template-alist
               '("sh" "#+BEGIN_SRC sh\n?\n#+END_SRC" "<src lang=\"shell\">\n?\n</src>"))
  ;(setq org-babel-python-command "~/anaconda/bin/ipython --no-banner --classic --no-confirm-exit")

  ;; ** Clean view
  (setq org-startup-indented t)
  (setq org-indent-mode t)
  (setq org-hide-leading-stars t)
  (defun prettier-org-code-blocks-upper ()
    (interactive)
    (font-lock-add-keywords nil
                            '(("\\(\+BEGIN_SRC\\)"
                               (0 (progn (compose-region (match-beginning 1) (match-end 1) ?¦)
                                         nil))) 
                              ("\\(\+END_SRC\\)"
                               (0 (progn (compose-region (match-beginning 1) (match-end 1) ?¦)
                                         nil))))))
  (defun prettier-org-code-blocks-lower ()
    (interactive)
    (font-lock-add-keywords nil
                            '(("\\(^[[:space:]]*#\\+begin_src .*[\r\n]\\)"
                               (0 (progn (compose-region (match-beginning 1) (match-end 1) "")
                                         nil)))
                              ("\\(^[[:space:]]*#\\+end_src[\r\n]\\)"
                               (0 (progn (compose-region (match-beginning 1) (match-end 1) "")
                                         nil))))))
  (add-hook 'org-mode-hook 'prettier-org-code-blocks-lower)
  (add-hook 'org-mode-hook 'prettier-org-code-blocks-upper)

  ;; ** Links
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key "\C-c L" 'org-insert-link-global)
  (setq org-return-follows-link t) ; <RET> will also follow the link at point

  ;; ** Refile
  ; Targets include this file and any file contributing to the agenda - up to 9 levels deep
  ; Allow refile to create parent tasks with confirmation
  ;(setq org-refile-allow-creating-parent-nodes (quote confirm))
  ; Use IDO for both buffer and file completion and ido-everywhere to t
  ;(setq org-completion-use-ido t)
  ;(setq ido-everywhere t)
  ;(setq ido-max-directory-size 100000)
  ;(ido-mode (quote both))
  ; Use the current window when visiting files and buffers with ido
  ;(setq ido-default-file-method 'selected-window)
  ;(setq ido-default-buffer-method 'selected-window)
  ; Use the current window for indirect buffer display
  (setq org-indirect-buffer-display 'current-window)
  ;;;; Refile settings
  ; Exclude DONE state tasks from refile targets
  (defun bh/verify-refile-target ()
    "Exclude todo keywords with a done state from refile targets"
    (not (member (nth 2 (org-heading-components)) org-done-keywords)))
  (setq org-refile-target-verify-function 'bh/verify-refile-target)

  ;; ** Org Key bindings
  (global-set-key (kbd "<f2>") (kbd "C-c '"))
  (global-set-key (kbd "<C-menu>") (kbd "C-c C-v p"))
  (global-set-key (kbd "<C-M-menu>") (kbd "C-c C-v n"))
  (global-set-key (kbd "<C-apps>") (kbd "C-c C-v p"))
  (global-set-key (kbd "<C-M-apps>") (kbd "C-c C-v n"))
  (global-set-key (kbd "<f1>") 'outline-previous-visible-heading)
  (global-set-key (kbd "M-p") 'previous-error)
  (global-set-key (kbd "M-n") 'next-error)
#+END_SRC
